wodecoin/mm32f5270_nano_frame/base/library/MM32F5270/Include/reg_adc.h
/**
  * @brief ADC_ANY_CR Register Bit Definition
  */
#define  ADC_ANY_CR_CHANY_MDEN_Pos                (0)
#define  ADC_ANY_CR_CHANY_MDEN_Msk                (0x01U << ADC_ANY_CR_CHANY_MDEN_Pos) /*!<*/
#define  ADC_ANY_CR_JCEN_Pos                      (1)
#define  ADC_ANY_CR_JCEN_Msk                      (0x01U << ADC_ANY_CR_JCEN_Pos)       /*!<*/
#define  ADC_ANY_CR_JEOSMPIE_Pos                  (2)
#define  ADC_ANY_CR_JEOSMPIE_Msk                  (0x01U << ADC_ANY_CR_JEOSMPIE_Pos)   /*!<*/
#define  ADC_ANY_CR_JEOCIE_Pos                    (3)
#define  ADC_ANY_CR_JEOCIE_Msk                    (0x01U << ADC_ANY_CR_JEOCIE_Pos)     /*!<*/
#define  ADC_ANY_CR_JEOSIE_Pos                    (4)
#define  ADC_ANY_CR_JEOSIE_Msk                    (0x01U << ADC_ANY_CR_JEOSIE_Pos)     /*!<*/
#define  ADC_ANY_CR_JAUTO_Pos                     (5)
#define  ADC_ANY_CR_JAUTO_Msk                     (0x01U << ADC_ANY_CR_JAUTO_Pos)      /*!<*/
#define  ADC_ANY_CR_JADST_Pos                     (6)
#define  ADC_ANY_CR_JADST_Msk                     (0x01U << ADC_ANY_CR_JADST_Pos)      /*!<*/
#define  ADC_ANY_CR_JTRGEN_Pos                    (7)
#define  ADC_ANY_CR_JTRGEN_Msk                    (0x01U << ADC_ANY_CR_JTRGEN_Pos)     /*!<*/
#define  ADC_ANY_CR_JTRGSEL_Pos                   (8)
#define  ADC_ANY_CR_JTRGSEL_Msk                   (0x1FU << ADC_ANY_CR_JTRGSEL_Pos)    /*!<*/
#define  ADC_ANY_CR_JTRGSHIFT_Pos                 (13)
#define  ADC_ANY_CR_JTRGSHIFT_Msk                 (0x07U << ADC_ANY_CR_JTRGSHIFT_Pos)  /*!<*/
#define  ADC_ANY_CR_JTRG_EDGE_Pos                 (16)
#define  ADC_ANY_CR_JTRG_EDGE_Msk                 (0x03U << ADC_ANY_CR_JTRG_EDGE_Pos)  /*!<*/
#define  ADC_ANY_CR_ADCAL_Pos                     (20)
#define  ADC_ANY_CR_ADCAL_Msk                     (0x01U << ADC_ANY_CR_ADCAL_Pos)      /*!<*/
#define  ADC_ANY_CR_EOCALIE_Pos                   (21)
#define  ADC_ANY_CR_EOCALIE_Msk                   (0x01U << ADC_ANY_CR_EOCALIE_Pos)    /*!<*/

/**
  * @brief ADC_ADCFG2 Register Bit Definition
  */
#define  ADC_ADCFG2_ADCCR_Pos                     (1)
#define  ADC_ADCFG2_ADCCR_Msk                     (0x01U << ADC_ADCFG2_ADCCR_Pos)   /*!<*/
#define  ADC_ADCFG2_ADCSREF_Pos                   (2)
#define  ADC_ADCFG2_ADCSREF_Msk                   (0x01U << ADC_ADCFG2_ADCSREF_Pos) /*!<*/
#define  ADC_ADCFG2_DC_Pos                        (4)
#define  ADC_ADCFG2_DC_Msk                        (0x1FU << ADC_ADCFG2_DC_Pos)      /*!<*/
#define  ADC_ADCFG2_PSDC_Pos                      (10)
#define  ADC_ADCFG2_PSDC_Msk                      (0x1FU << ADC_ADCFG2_PSDC_Pos)    /*!<*/
#define  ADC_ADCFG2_ROVSE_Pos                     (16)
#define  ADC_ADCFG2_ROVSE_Msk                     (0x01U << ADC_ADCFG2_ROVSE_Pos)   /*!<*/
#define  ADC_ADCFG2_JOVSE_Pos                     (17)
#define  ADC_ADCFG2_JOVSE_Msk                     (0x01U << ADC_ADCFG2_JOVSE_Pos)   /*!<*/
#define  ADC_ADCFG2_OVSR_Pos                      (18)
#define  ADC_ADCFG2_OVSR_Msk                      (0x07U << ADC_ADCFG2_OVSR_Pos)    /*!<*/
#define  ADC_ADCFG2_OVSS_Pos                      (21)
#define  ADC_ADCFG2_OVSS_Msk                      (0x0FU << ADC_ADCFG2_OVSS_Pos)    /*!<*/
#define  ADC_ADCFG2_TROVS_Pos                     (25)
#define  ADC_ADCFG2_TROVS_Msk                     (0x01U << ADC_ADCFG2_TROVS_Pos)   /*!<*/

/**
  * @brief ADC_SMPR1 Register Bit Definition
  */
#define  ADC_SMPR1_SAMP0_Pos                      (0)
#define  ADC_SMPR1_SAMP0_Msk                      (0x0FU << ADC_SMPR1_SAMP0_Pos) /*!<*/
#define  ADC_SMPR1_SAMP1_Pos                      (4)
#define  ADC_SMPR1_SAMP1_Msk                      (0x0FU << ADC_SMPR1_SAMP1_Pos) /*!<*/
#define  ADC_SMPR1_SAMP2_Pos                      (8)
#define  ADC_SMPR1_SAMP2_Msk                      (0x0FU << ADC_SMPR1_SAMP2_Pos) /*!<*/
#define  ADC_SMPR1_SAMP3_Pos                      (12)
#define  ADC_SMPR1_SAMP3_Msk                      (0x0FU << ADC_SMPR1_SAMP3_Pos) /*!<*/
#define  ADC_SMPR1_SAMP4_Pos                      (16)
#define  ADC_SMPR1_SAMP4_Msk                      (0x0FU << ADC_SMPR1_SAMP4_Pos) /*!<*/
#define  ADC_SMPR1_SAMP5_Pos                      (20)
#define  ADC_SMPR1_SAMP5_Msk                      (0x0FU << ADC_SMPR1_SAMP5_Pos) /*!<*/
#define  ADC_SMPR1_SAMP6_Pos                      (24)
#define  ADC_SMPR1_SAMP6_Msk                      (0x0FU << ADC_SMPR1_SAMP6_Pos) /*!<*/
#define  ADC_SMPR1_SAMP7_Pos                      (28)
#define  ADC_SMPR1_SAMP7_Msk                      (0x0FU << ADC_SMPR1_SAMP7_Pos) /*!<*/

/**
  * @brief ADC_SMPR2 Register Bit Definition
  */
#define  ADC_SMPR2_SAMP8_Pos                      (0)
#define  ADC_SMPR2_SAMP8_Msk                      (0x0FU << ADC_SMPR2_SAMP8_Pos)  /*!<*/
#define  ADC_SMPR2_SAMP9_Pos                      (4)
#define  ADC_SMPR2_SAMP9_Msk                      (0x0FU << ADC_SMPR2_SAMP9_Pos)  /*!<*/
#define  ADC_SMPR2_SAMP10_Pos                     (8)
#define  ADC_SMPR2_SAMP10_Msk                     (0x0FU << ADC_SMPR2_SAMP10_Pos) /*!<*/
#define  ADC_SMPR2_SAMP11_Pos                     (12)
#define  ADC_SMPR2_SAMP11_Msk                     (0x0FU << ADC_SMPR2_SAMP11_Pos) /*!<*/
#define  ADC_SMPR2_SAMP12_Pos                     (16)
#define  ADC_SMPR2_SAMP12_Msk                     (0x0FU << ADC_SMPR2_SAMP12_Pos) /*!<*/
#define  ADC_SMPR2_SAMP13_Pos                     (20)
#define  ADC_SMPR2_SAMP13_Msk                     (0x0FU << ADC_SMPR2_SAMP13_Pos) /*!<*/
#define  ADC_SMPR2_SAMP14_Pos                     (24)
#define  ADC_SMPR2_SAMP14_Msk                     (0x0FU << ADC_SMPR2_SAMP14_Pos) /*!<*/
#define  ADC_SMPR2_SAMP15_Pos                     (28)
#define  ADC_SMPR2_SAMP15_Msk                     (0x0FU << ADC_SMPR2_SAMP15_Pos) /*!<*/

/**
  * @brief ADC_SMPR3 Register Bit Definition
  */
#define  ADC_SMPR3_SAMP16_Pos                     (0)
#define  ADC_SMPR3_SAMP16_Msk                     (0x0FU << ADC_SMPR3_SAMP16_Pos) /*!<*/
#define  ADC_SMPR3_SAMP17_Pos                     (4)
#define  ADC_SMPR3_SAMP17_Msk                     (0x0FU << ADC_SMPR3_SAMP17_Pos) /*!<*/
#define  ADC_SMPR3_SAMP18_Pos                     (8)
#define  ADC_SMPR3_SAMP18_Msk                     (0x0FU << ADC_SMPR3_SAMP18_Pos) /*!<*/

/**
  * @brief ADC_JOFR Register Bit Definition
  */
#define  ADC_JOFR_JOFFSET_Pos                     (0)
#define  ADC_JOFR_JOFFSET_Msk                     (0x0FFFU << ADC_JOFR_JOFFSET_Pos) /*!<*/

/**
  * @brief ADC_JSQR Register Bit Definition
  */
#define  ADC_JSQR_JSQ0_Pos                        (0)
#define  ADC_JSQR_JSQ0_Msk                        (0x1FU << ADC_JSQR_JSQ0_Pos) /*!<*/
#define  ADC_JSQR_JSQ1_Pos                        (5)
#define  ADC_JSQR_JSQ1_Msk                        (0x1FU << ADC_JSQR_JSQ1_Pos) /*!<*/
#define  ADC_JSQR_JSQ2_Pos                        (10)
#define  ADC_JSQR_JSQ2_Msk                        (0x1FU << ADC_JSQR_JSQ2_Pos) /*!<*/
#define  ADC_JSQR_JSQ3_Pos                        (15)
#define  ADC_JSQR_JSQ3_Msk                        (0x1FU << ADC_JSQR_JSQ3_Pos) /*!<*/
#define  ADC_JSQR_JNUM_Pos                        (20)
#define  ADC_JSQR_JNUM_Msk                        (0x03U << ADC_JSQR_JNUM_Pos) /*!<*/

/**
  * @brief ADC_JADDATA Register Bit Definition
  */
#define  ADC_JADDATA_JDATA_Pos                    (0)
#define  ADC_JADDATA_JDATA_Msk                    (0xFFFFU << ADC_JADDATA_JDATA_Pos)     /*!<*/
#define  ADC_JADDATA_JCHANNELSEL_Pos              (16)
#define  ADC_JADDATA_JCHANNELSEL_Msk              (0x1FU << ADC_JADDATA_JCHANNELSEL_Pos) /*!<*/
#define  ADC_JADDATA_JOVERRUN_Pos                 (21)
#define  ADC_JADDATA_JOVERRUN_Msk                 (0x01U << ADC_JADDATA_JOVERRUN_Pos)    /*!<*/
#define  ADC_JADDATA_JVALID_Pos                   (22)
#define  ADC_JADDATA_JVALID_Msk                   (0x01U << ADC_JADDATA_JVALID_Pos)      /*!<*/

/**
  * @brief ADC_JDR Register Bit Definition
  */
#define  ADC_JDR_JDATA_Pos                        (0)
#define  ADC_JDR_JDATA_Msk                        (0xFFFFU << ADC_JDR_JDATA_Pos)  /*!<*/
#define  ADC_JDR_JOVERRUN_Pos                     (21)
#define  ADC_JDR_JOVERRUN_Msk                     (0x01U << ADC_JDR_JOVERRUN_Pos) /*!<*/
#define  ADC_JDR_JVALID_Pos                       (22)
#define  ADC_JDR_JVALID_Msk                       (0x01U << ADC_JDR_JVALID_Pos)   /*!<*/

#endif

